/* Этот файл сгенерирован автоматически: npm run generate:PaymentIcon */
block('payment-icon')(
	mod('name', 'mastercard-brand')(
		content()(function() {
			return `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 16"><g fill="none"><path fill="#FF5F00" d="M9 3.284h6v9.434H9z"/><path fill="#EB001B" d="M9.646 8c0-1.839.868-3.576 2.354-4.717A6.269 6.269 0 008.186 2 6.28 6.28 0 003.81 3.756 5.906 5.906 0 002 8a5.906 5.906 0 001.81 4.244A6.28 6.28 0 008.186 14 6.269 6.269 0 0012 12.716C10.51 11.578 9.643 9.84 9.646 8z"/><path fill="#F79E1B" d="M22 8a5.906 5.906 0 01-1.81 4.244A6.28 6.28 0 0115.813 14 6.27 6.27 0 0112 12.716C13.493 11.58 14.361 9.84 14.354 8c0-1.839-.867-3.576-2.354-4.717A6.27 6.27 0 0115.814 2C19.234 2 22 4.7 22 8z"/></g></svg>`;
		})
	)
);
