/* Этот файл сгенерирован автоматически: npm run generate:Icon2 */
block('icon2')(
	mod('name', 'alert-unread').mod('size', 'm')(
		content()(function() {
			return `<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24"><path fill-rule="evenodd" d="M16.709 19.544V20c0 1.105-.891 2-1.99 2-1.1 0-1.991-.895-1.991-2v-.947L2 17.729l.243-1.985 3.327-2.612.485-3.97a6.988 6.988 0 015.77-6.054 1.5 1.5 0 011.623-1.094l.986.121a1.494 1.494 0 011.312 1.457 7.008 7.008 0 014.14 7.276l-.486 3.97 2.6 3.343-.243 1.986-5.048-.623z"/></svg>`;
		})
	),
	mod('name', 'alert-unread').mod('size', 's')(
		content()(function() {
			return `<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16"><path fill-rule="evenodd" d="M10.945 13.327v.168c0 .831-.671 1.505-1.498 1.505a1.501 1.501 0 01-1.499-1.505v-.538L1 12.1l.122-.995 2.226-1.75.365-2.984a5.005 5.005 0 014.562-4.39l.012-.1a1 1 0 011.983.245l-.013.1a5.019 5.019 0 013.369 5.367l-.365 2.987L15 12.816l-.122.996-3.933-.485z"/></svg>`;
		})
	)
);
