/* Этот файл сгенерирован автоматически: npm run generate:Icon2 */
block('icon2')(
	mod('name', 'repeat').mod('size', 'm')(
		content()(function() {
			return `<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24"><path fill-rule="evenodd" d="M6.296 17.704L9 15H2v7l2.858-2.858A10.279 10.279 0 0012 22c4.937 0 9.055-3.436 10-8h-2.107c-.924 3.454-4.107 6-7.893 6a8.187 8.187 0 01-5.704-2.296zM17.704 6.296L15 9h7V2l-2.858 2.858A10.279 10.279 0 0012 2C7.063 2 2.945 5.436 2 10h2.107C5.031 6.546 8.214 4 12 4c2.22 0 4.232.875 5.704 2.296z"/></svg>`;
		})
	),
	mod('name', 'repeat').mod('size', 's')(
		content()(function() {
			return `<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16"><path fill-rule="evenodd" d="M4.447 11.553A5.061 5.061 0 008 13c2.444 0 4.482-1.718 4.95-4H15c-.49 3.392-3.437 6-7 6a7.086 7.086 0 01-4.975-2.025L1 15V9.5h5.5l-2.053 2.053zm7.106-7.106A5.061 5.061 0 008 3C5.556 3 3.518 4.718 3.05 7H1c.49-3.392 3.437-6 7-6 1.94 0 3.697.773 4.975 2.025L15 1v5.5H9.5l2.053-2.053z"/></svg>`;
		})
	)
);
