/* Этот файл сгенерирован автоматически: npm run generate:Icon2 */
block('icon2')(
	mod('name', 'logo-masterpass').mod('size', 'm')(
		content()(function() {
			return `<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24"><path fill-rule="evenodd" d="M10 12c0-1.906.764-3.632 2-4.895A6.976 6.976 0 0114 12a6.976 6.976 0 01-2 4.895A6.976 6.976 0 0110 12zm-.927 0c0 2.142.846 4.083 2.217 5.519A6.958 6.958 0 017 18.999 7 7 0 117 5c1.62 0 3.104.559 4.29 1.483A7.963 7.963 0 009.073 12zM17 5a7 7 0 110 14 6.956 6.956 0 01-4.261-1.46A7.963 7.963 0 0014.977 12a7.965 7.965 0 00-2.238-5.541A6.956 6.956 0 0117 4.999z"/></svg>`;
		})
	),
	mod('name', 'logo-masterpass').mod('size', 's')(
		content()(function() {
			return `<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16"><path fill-rule="evenodd" d="M10 8c0 1.623-.783 3.068-2 4-1.218-.932-2-2.377-2-4 0-1.624.782-3.068 2-4 1.217.932 2 2.376 2 4zM5.5 8c0 1.73.8 3.27 2.049 4.28A4.95 4.95 0 015 13 5 5 0 115 3c.936 0 1.8.273 2.549.72A5.486 5.486 0 005.5 8zM11 3a5 5 0 010 10 4.95 4.95 0 01-2.513-.7 5.49 5.49 0 000-8.6A4.95 4.95 0 0111 3z"/></svg>`;
		})
	)
);
